//BCPCON  JOB FB3,'CMP BCPCON',REGION=0M,CLASS=7
//*
//         EXPORT SYMLIST=(*)
//         SET MEMBER='BCPCON'
//*
//CICSPROG EXEC DFHZITCL
//COBOL.SYSIN  DD DISP=SHR,DSN=Z83078.PROYECTO.CBL(&MEMBER.)
//COBOL.SYSLIB DD DISP=SHR,DSN=Z83078.PROYECTO.COPY
//         DD DISP=SHR,DSN=DFH620.CICS.SDFHCOB
//         DD DISP=SHR,DSN=DFH620.CICS.SDFHMAC
//         DD DISP=SHR,DSN=DFH620.CICS.SDFHSAMP
//LKED.SYSLMOD DD DISP=SHR,DSN=Z83078.PROYECTO.LOAD
//LKED.SYSIN DD *,SYMBOLS=EXECSYS
  NAME &MEMBER.(R)
/*
