//BCPSELDB JOB FB3,'DB2 BCPSEL',REGION=0M,CLASS=7,MSGCLASS=A
//*------------------------------------------------------------------*
//* DB2 PRECOMPILE AND CICS COBOL COMPILE/LINK FOR BCPSEL            *
//*------------------------------------------------------------------*
//         EXPORT SYMLIST=*
//         SET MEMBER='BCPSEL'
//         SET DBRMLIB='Z83078.DBRMLIB'
//*
//COBOL    EXEC DFHZITCL,
//         PARM.COBOL='CICS,NODYNAM,BUF(12288),SOURCE,NOXREF,SQL'
//COBOL.STEPLIB DD DISP=SHR,DSN=IGY650.SIGYCOMP
//         DD DISP=SHR,DSN=CEE.SCEERUN
//         DD DISP=SHR,DSN=CEE.SCEERUN2
//         DD DISP=SHR,DSN=DSND10.DBDG.SDSNEXIT
//         DD DISP=SHR,DSN=DSND10.SDSNLOAD
//         DD DISP=SHR,DSN=DFH620.CICS.SDFHLOAD
//COBOL.DBRMLIB DD DISP=SHR,DSN=&DBRMLIB(&MEMBER.)
//COBOL.SYSIN DD DSN=Z83078.PROYECTO.CBL(&MEMBER.),DISP=SHR
//COBOL.SYSLIB DD DISP=SHR,DSN=Z83078.PROYECTO.COPY
//         DD DISP=SHR,DSN=Z83078.PROYECTO.SQL
//         DD DISP=SHR,DSN=DFH620.CICS.SDFHCOB
//         DD DISP=SHR,DSN=DFH620.CICS.SDFHMAC
//         DD DISP=SHR,DSN=DFH620.CICS.SDFHSAMP
//COBOL.SYSMDECK DD UNIT=SYSDA,SPACE=(TRK,(5,5))
//COBOL.SYSPRINT DD SYSOUT=*
//COBOL.SYSUDUMP DD SYSOUT=*
//LKED.SYSLMOD DD DISP=SHR,DSN=Z83078.PROYECTO.LOAD
//LKED.SYSIN DD *,SYMBOLS=EXECSYS
  NAME &MEMBER.(R)
/*
