//DB2BIND JOB FB3,'BIND BCPCON',CLASS=7,MSGLEVEL=(2,1)
//         EXPORT SYMLIST=(SSID)
//         SET SSID=DBDG
//DSNTSO   EXEC PGM=IKJEFT01,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=Z83078.LOAD
//         DD DISP=SHR,DSN=ZXP.PUBLIC.LOAD
//         DD DISP=SHR,DSN=DSND10.SDSNLOAD
//         DD DISP=SHR,DSN=DSND10.SDSNLOD2
//DBRMLIB  DD DISP=SHR,DSN=Z83078.DBRMLIB
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *,SYMBOLS=EXECSYS
  DSN SYSTEM(&SSID.)
  BIND PLAN(Z83078) -
      MEMBER(BCPCON,BCPDEP,BCPMOV,BCPRET,BCPLOG) -
       LIBRARY('Z83078.DBRMLIB') -
       ACTION(REPLACE) -
       ISOLATION(CS) -
       VALIDATE(BIND)
  END
/*
