//MOVASM   JOB FB3,,REGION=4M,CLASS=7,MSGCLASS=A,NOTIFY=&SYSUID
//*
//MYLIB    JCLLIB ORDER=(DFH620.CICS.SDFHPROC)
//*
//BUILD    EXEC DFHMAPS,
//         INDEX='DFH620.CICS',
//         MAPLIB='Z83078.PROYECTO.LOAD',
//         DSCTLIB='Z83078.PROYECTO.COPY',
//         MAPNAME=MOVMAP
//COPY.SYSUT1 DD DISP=SHR,
//            DSN=Z83078.PROYECTO.BMS(MOVMAP)
//LINKMAP.SYSLMOD DD DISP=SHR,
//            DSN=Z83078.PROYECTO.LOAD(MOVSET)
