//MOVREPRN JOB FB3,'RUN MOV REPORT',REGION=0M,CLASS=7,MSGCLASS=A
//         EXPORT SYMLIST=(SSID)
//         SET SSID='DBDG'
//RUN      EXEC PGM=IKJEFT01
//STEPLIB  DD DISP=SHR,DSN=Z83078.PROYECTO.LOAD
//         DD DISP=SHR,DSN=DSND10.SDSNLOAD
//MOVVSAM  DD DISP=OLD,DSN=Z83078.PROYECTO.MOV.DIARIO
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *,SYMBOLS=EXECSYS
  DSN SYSTEM(&SSID.)
  RUN PROGRAM(MOVREP) PLAN(Z83078) -
      LIBRARY('Z83078.PROYECTO.LOAD')
  END
/*
