//MOVVSAM  JOB FB3,'VSAM MOVIMIENTOS',CLASS=7,MSGCLASS=A
//* DEFINE THE DAILY VSAM KSDS USED BY THE BATCH REPORT
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE Z83078.PROYECTO.MOV.DIARIO CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(Z83078.PROYECTO.MOV.DIARIO) -
                  INDEXED -
                  KEYS(36 0) -
                  RECORDSIZE(85 85) -
                  TRACKS(10 5) -
                  FREESPACE(10 10)) -
         DATA (NAME(Z83078.PROYECTO.MOV.DIARIO.DATA)) -
         INDEX(NAME(Z83078.PROYECTO.MOV.DIARIO.INDEX))
/*
