RETSET   DFHMSD TYPE=&SYSPARM,                                         X
               LANG=COBOL,                                             X
               MODE=INOUT,                                             X
               TERM=3270-2,                                            X
               CTRL=(FREEKB,FRSET),                                    X
               STORAGE=AUTO,                                           X
               TIOAPFX=YES
*
RETMAP   DFHMDI SIZE=(24,80),                                          X
               LINE=1,                                                 X
               COLUMN=1
*
         DFHMDF POS=(1,29),                                            X
               LENGTH=22,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='RETIRO DE CUENTA'
*
         DFHMDF POS=(4,5),                                             X
               LENGTH=18,                                              X
               ATTRB=(PROT,NORM),                                      X
               INITIAL='NRO. CUENTA:'
NROCUENTA DFHMDF POS=(4,25),                                           X
               LENGTH=10,                                              X
               ATTRB=(PROT,NORM),                                       X
               PICIN='X(10)',                                          X
               PICOUT='X(10)'
*
         DFHMDF POS=(6,5),                                             X
               LENGTH=10,                                              X
               ATTRB=(PROT,NORM),                                      X
               INITIAL='MONTO:'
MONTO    DFHMDF POS=(6,25),                                            X
               LENGTH=15,                                              X
               ATTRB=(UNPROT,NUM,IC),                                  X
               PICIN='X(15)',                                          X
               PICOUT='X(15)'
*
MENSAJE  DFHMDF POS=(10,5),                                            X
               LENGTH=60,                                              X
               ATTRB=(PROT,NORM,FSET),                                 X
               INITIAL=' '
*
         DFHMDF POS=(24,1),                                            X
               LENGTH=40,                                              X
               ATTRB=(PROT,NORM),                                      X
               INITIAL='ENTER=Retirar  PF3=Salir'
*
         DFHMSD TYPE=FINAL
         END
