       01 SELMAPI.
          02 FILLER       PIC X(12).
          02 FILLER       PIC X(3).
          02 CUENTA1O     PIC X(10).
          02 FILLER       PIC X(3).
          02 CUENTA2O     PIC X(10).
          02 FILLER       PIC X(3).
          02 CUENTA3O     PIC X(10).
          02 FILLER       PIC X(3).
          02 CUENTA4O     PIC X(10).
          02 FILLER       PIC X(3).
          02 OPCIONL COMP PIC S9(4).
          02 OPCIONF      PIC X.
          02 FILLER REDEFINES OPCIONF.
             03 OPCIONA   PIC X.
          02 OPCIONI      PIC X(1).
          02 MENSAJEL COMP
                          PIC S9(4).
          02 MENSAJEF     PIC X.
          02 FILLER REDEFINES MENSAJEF.
             03 MENSAJEA  PIC X.
          02 MENSAJEI     PIC X(60).